tap "homebrew/bundle"
tap "homebrew/services"
tap "withgraphite/tap"
brew "bat"
brew "btop"
brew "eza"
brew "gdal"
brew "lazygit"
brew "neovim"
brew "node"
brew "pango"
brew "pnpm", link: false
brew "postgresql@14"
brew "pre-commit"
brew "redis"
brew "starship"
brew "stow"
brew "tailscale", restart_service: :changed
brew "tldr"
brew "zoxide"
brew "withgraphite/tap/graphite"
cask "alt-tab"
cask "arc"
cask "betterdisplay"
cask "bitwarden"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "intellij-idea"
cask "linearmouse"
cask "logi-options+"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "numi"
cask "obsidian"
cask "postman-agent"
cask "raycast"
cask "rectangle"
cask "redis-insight"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "zen-browser"